[
    {
        "name": "Cinnamom",
        "id": 1,
        "description": "Cinnamom is a spice obtained from the inner bark of several tree species from the genus Cinnamomum. Cinnamon is used mainly as an aromatic condiment and flavouring additive in a wide variety of cuisines, sweet and savoury dishes, breakfast cereals, snack foods, bagels, teas, hot chocolate and traditional foods. The aroma and flavour of cinnamon derive from its essential oil and principal component, cinnamaldehyde, as well as numerous other constituents including eugenol.Cinnamon is the name for several species of trees and the commercial spice products that some of them produce. All are members of the genus Cinnamomum in the family Lauraceae. Only a few Cinnamomum species are grown commercially for spice. Cinnamomum verum (alternatively C. zeylanicum), known as  after its origins in Sri Lanka (formerly Ceylon), is considered to be ,[1] but most cinnamon in international commerce is derived from four other species, usually and more correctly referred to as C. burmanni (Indonesian cinnamon or Padang cassia), C. cassia (Chinese cinnamon or Chinese cassia), C. loureiroi (Saigon cinnamon or Vietnamese cassia), and the less common C. citriodorum (Malabar cinnamon).",
        "etymology": "The English word cinnamon, attested in English since the 15th century, deriving from the Ancient Greek κιννάμωμον (kinnámōmon, later κίνναμον : kínnamon), via Latin and medieval French intermediate forms. The Greek was borrowed from a Phoenician word, which was similar to the related Hebrew word .",
        "history": "Cinnamon has been known from remote antiquity.[10] It was imported to Egypt as early as 2000 BC, but those who reported that it had come from China had confused it with Cinnamomum cassia, a related species.[3] Cinnamon was so highly prized among ancient nations that it was regarded as a gift fit for monarchs[10] and even for a deity; an inscription records the gift of cinnamon and cassia to the temple of Apollo at Miletus.[11] Its source was kept a trade secret in the Mediterranean world for centuries by those in the spice trade, in order to protect their monopoly as suppliers.",
        "kingdom": "Animalia",
        "clade": "Carnivora",
        "order": "Carnivora",
        "family": "Felidae",
        "genus": "Panthera",
        "image": "https://i.ibb.co/kx6k4hW/Cinnamom-Cassia-5.jpg",
        "image1": "https://i.ibb.co/Lv6wHW6/Cinnamomum-verum-K-hler-s-Medizinal-Pflanzen-182.jpg",
        "category": "spices",
        "status": "spices"
    },
    {
        "name": "Turmeric",
        "id": 2,
        "description": "Turmeric  or Curcuma longa  is a flowering plant in the ginger family Zingiberaceae. It is a perennial, rhizomatous, herbaceous plant native to the Indian subcontinent and Southeast Asia that requires temperatures between 20 and 30 °C (68 and 86 °F) and high annual rainfall to thrive. Plants are gathered each year for their rhizomes, some for propagation in the following season and some for consumption The rhizomes are used fresh or boiled in water and dried, after which they are ground into a deep orange-yellow powder commonly used as a coloring and flavoring agent in many Asian cuisines, especially for curries, as well as for the dyeing characteristics imparted by the principal turmeric constituent, curcumin.",
        "etymology": "The name possibly derives from Middle English or Early Modern English as turmeryte or tarmaret. It may be of Latin origin, terra merita . The Latin specific epithet longa means long.",
        "history": "Turmeric has been used in Asia for centuries and is a major part of Ayurveda, Siddha medicine, traditional Chinese medicine, Unani, and the animistic rituals of Austronesian peoples. It was first used as a dye, and then later for its supposed properties in folk medicine.From India, it spread to Southeast Asia along with Hinduism and Buddhism, as the yellow dye is used to color the robes of monks and priests. Turmeric has also been found in Tahiti, Hawaii and Easter Island before European contact. There is linguistic and circumstantial evidence of the spread and use of turmeric by the Austronesian peoples into Oceania and Madagascar. The populations in Polynesia and Micronesia, in particular, never came into contact with India, but use turmeric widely for both food and dye. Thus independent domestication events are also likely.",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Zingiberales",
        "family": "Zingiberaceae",
        "genus": "Curcuma",
        "image": "https://i.ibb.co/NpkMh2W/Dry-Turmeric-5.jpg",
        "image1": "https://i.ibb.co/FXGDd67/Curcuma-longa-K-hler-s-Medizinal-Pflanzen-199.jpg",
        "category": "spices",
        "status": "spices"
    },
    {
        "name": "Black Pepper",
        "id": 3,
        "description": "Black pepper (Piper nigrum) is a flowering vine in the family Piperaceae, cultivated for its fruit (the peppercorn), which is usually dried and used as a spice and seasoning. The fruit is a drupe (stonefruit) which is about 5 mm (0.20 in) in diameter (fresh and fully mature), dark red, and contains a stone which encloses a single pepper seed. Peppercorns and the ground pepper derived from them may be described simply as pepper, or more precisely as black pepper (cooked and dried unripe fruit), green pepper (dried unripe fruit), or white pepper Black pepper is native to the Malabar Coast of India,[3][4] and the Malabar pepper is extensively cultivated there and in other tropical regions. Ground, dried, and cooked peppercorns have been used since antiquity, both for flavour and as a traditional medicine. Black pepper is the world's most traded spice,[5] and is one of the most common spices added to cuisines around the world",
        "etymology": "The word pepper derives from Old English pipor, Latin piper, and Greek: πέπερι.[6] The Greek likely derives from Dravidian pippali, meaning long pepper.[7] Sanskrit pippali shares the same meaning",
        "history": "The ancient history of black pepper is often interlinked with (and confused with) that of long pepper, the dried fruit of closely related Piper longum. The Romans knew of both and often referred to either as just piper. In fact, the popularity of long pepper did not entirely decline until the discovery of the New World and of chili peppers. Chili peppers—some of which, when dried, are similar in shape and taste to long pepper—were easier to grow in a variety of locations more convenient to Europe. Before the 16th century, pepper was being grown in Java, Sunda, Sumatra, Madagascar, Malaysia, and everywhere in Southeast Asia. These areas traded mainly with China, or used the pepper locally.[26] Ports in the Malabar area also served as a stop-off point for much of the trade in other spices from farther east in the Indian Ocean",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Piperales",
        "family": "Piperaceae",
        "genus": "Piper",
        "image": "https://i.ibb.co/K6Z1zXZ/Black-Pepper-2.jpg",
        "image1": "https://i.ibb.co/FYr163M/Piper-nigrum-K-hler-s-Medizinal-Pflanzen-107-1.jpg",
        "category": "spices",
        "status": "seeds"
    },
    {
        "name": "Coriender Seeds",
        "id": 4,
        "description": "Coriander (/ˌkɒriˈændər, ˈkɒriændər/; Coriandrum sativum), also known as cilantro (/sɪˈlæntroʊ, -ˈlɑːn-/),[1]: 90  is an annual herb in the family Apiaceae. All parts of the plant are edible, but the fresh leaves and the dried seeds are the parts most traditionally used in cooking.Most people perceive coriander as having a tart,;, lemon/lime taste, but some individuals perceive the leaves to have a soapy, pungent, or rotten taste. The perception of a soapy taste in certain aldehydes is linked to variations in the gene It is a soft plant growing to 50 cm (20 in) tall. The leaves are variable in shape, broadly lobed at the base of the plant, and slender and feathery higher on the flowering stems.",
        "etymology": "First attested in English during the late 14th century, the word coriander derives from the Old French coriandre, which comes from Latin coriandrum, in turn from Ancient Greek κορίαννον koríannon (or κορίανδρον koríandron), possibly derived from or related to κόρις kóris (a bed bug), and was given on account of its foetid, bug-like smel.",
        "history": "Coriander grows wild over a wide area of Western Asia and Southern Europe, prompting the comment: It is hard to define exactly where this plant is wild and where it only recently established itself.Recent works suggested that wild coriander in Israel and Portugal might be an ancestor of cultivated coriander.[17][better source needed][18][better source needed] They have low germination rates and a small vegetative appearance. Israeli coriander has an extremely hard fruit coat",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Sapindales",
        "family": "Apiaceae",
        "genus": "Coriandrum",
        "image": "https://i.ibb.co/rQjxZh8/Coriender-Seeds-8.jpg",
        "image1": "https://i.ibb.co/t8XKF68/Coriandrum-sativum-K-hler-s-Medizinal-Pflanzen-193.jpg",
        "category": "spices",
        "status": "seeds"
    },
    {
        "name": "White Pepper",
        "id": 13,
        "description": "White Pepper is the seventh studio album by the American rock band Ween, and the last album they would release on Elektra Records. It was released on May 2, 2000.The band helped promote the album by performing Exactly Where I'm At on the Late Show with David Letterman. The track Even If You Don't was made into a music video and directed by Trey Parker and Matt Stone of South Park fame.. According to Dean Ween (Mickey Melchiondo),,, he and Gene Ween (Aaron Freeman) are good friends of Parker and Stone, and Freeman has referred to them as kindred spirits.Stay Forever was written for cellist Tanya Haden",
        "etymology": "Middle English (abbreviated to ME[1]) is a form of the English language that was spoken after the Norman Conquest of 1066, until the late 15th century. The English language underwent distinct variations and developments following the Old English period. Scholarly opinion varies, but Oxford University Press specifies the period when Middle English was spoken as being from 1100 to 1500.[2] This stage of the development of the English language roughly followed the High to the Late Middle Ages.",
        "history": "The influence of Old Norse aided the development of English from a synthetic language with relatively free word order to a more analytic language with a stricter word order.[2][5] Both Old English and Old Norse (as well as the descendants of the latter, Faroese and Icelandic) were synthetic languages with complicated inflections. The eagerness of Vikings in the Danelaw to communicate with their Anglo-Saxon neighbours resulted in the erosion of inflection in both languages.[5][6] Old Norse may have had a more profound impact on Middle and Modern English development than any other language.[7][8][9] Simeon Potter says, No less far-reaching was the influence of Scandinavian upon the inflexional endings of English in hastening that wearing away and leveling of grammatical forms which gradually spread from north to south.",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Piperales",
        "family": "Piperaceae",
        "genus": "Piper",
        "image": "https://i.ibb.co/2sVJtqr/White-Pepper-2.jpg",
        "image1": "https://i.ibb.co/q7kp4fm/Ween-White-Pepper-1.jpg",
        "category": "spices",
        "status": "seeds"
    },
    {
        "name": "Green Cardamom",
        "id": 5,
        "description": "Cardamom (/ˈkɑːrdəməm/) sometimes cardamon or cardamum,[1] is a spice made from the seeds of several plants in the genera Elettaria and Amomum in the family Zingiberaceae. Both genera are native to the Indian subcontinent and Indonesia. They are recognized by their small seed pods: triangular in cross-section and spindle-shaped, with a thin, papery outer shell and small, black seeds; Elettaria pods are light green and smaller, while Amomum pods are larger and dark brown.Species used for cardamom are native throughout tropical and subtropical Asia. The first references to cardamom are found in Sumer, and in the Ayurvedic literature of India.[2] Nowadays it is also cultivated in Guatemala, Malaysia, and Tanzania.[3] The German coffee planter Oscar Majus Klöffer introduced Indian cardamom to cultivation in Guatemala before World War I; by 2000, that country had become the biggest producer and exporter of cardamom in the world, followed by India",
        "etymology": "The word cardamom is derived from the Latin cardamōmum,[5] which is the Latinisation of the Greek καρδάμωμον (kardámōmon),[6] a compound of κάρδαμον (kárdamon, cress)[7] and ἄμωμον (ámōmon), which was probably the name for a kind of Indian spice plant",
        "history": "Cardamom production began in ancient times, and has been referred to in ancient Sanskrit texts as ela.[24] The Babylonians and Assyrians recognized the health benefits of the spice early on, and trade in cardamom opened up along land routes and by the interlinked Persian Gulf route controlled from Dilmun as early as the third millennium BCE Early Bronze Age,[25] into western Asia and the Mediterranean world.",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Zingiberales",
        "family": "Zingiberaceae",
        "genus": "Elettaria",
        "image": "https://i.ibb.co/gjWscm6/Green-Cardamom-6.jpg",
        "image1": "https://i.ibb.co/Qmn0PGh/Elettaria-cardamomum-K-hler-s-Medizinal-Pflanzen-057.jpg",
        "category": "spices",
        "status": "spices"
    },
    {
        "name": "Almond",
        "id": 15,
        "description": "The almond (Prunus amygdalus, syn. Prunus dulcis) is a species of small tree from the genus Prunus, cultivated worldwide for its seed, a culinary nut. Along with the peach it is classified in the subgenus Amygdalus, distinguished from the other subgenera by corrugations on the shell endocarp surrounding the seed.The fruit of the almond is a drupe, consisting of an outer hull and a hard shell with the seed, which is not a true nut. Shelling almonds refers to removing the shell to reveal the seed. Almonds are sold shelled or unshelled. Blanched almonds are shelled almonds that have been treated with hot water to soften the seedcoat, which is then removed to reveal the white embryo. Once almonds are cleaned and processed, they can be stored over time. Almonds are used in many cuisines, often featuring prominently in desserts, such as marzipan.",
        "etymology": "The word almond comes from Old French almande or alemande,[23] Late Latin amandula, amindula, derived from amygdala from the Ancient Greek amygdálē (ἀμυγδάλη)[23][24] (cf. amygdala, an almond-shaped portion of the brain).[25] Late Old English had amygdales, almonds",
        "history": "Almonds were one of the earliest domesticated fruit trees, due to the ability of the grower to raise attractive almonds from seed.[6] Thus, in spite of the fact that this plant does not lend itself to propagation from suckers or from cuttings, it could have been domesticated even before the introduction of grafting.[28] Domesticated almonds appear in the Early Bronze Age (3000–2000 BC), such as the archaeological sites of Numeira (Jordan),[6] or possibly earlier. Another well-known archaeological example of the almond is the fruit found in Tutankhamun's tomb in Egypt (c. 1325 BC), probably imported from the Levant.[28] An article on almond tree cultivation in Spain is brought down in Ibn al-'Awwam's 12th-century agricultural work, Book on Agriculture.",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Prunus",
        "image": "https://i.ibb.co/bKy7vDw/Almond-1.jpg",
        "image1": "https://i.ibb.co/CJmCMWY/Prunus-dulcis-K-hler-s-Medizinal-Pflanzen-250.jpg",
        "category": "DryFood",
        "status": "DryFood"
    },
    {
        "name": "Cloves",
        "id": 6,
        "description": "The clove tree is an evergreen that grows up to 8–12 metres (26–39 ft) tall, with large leaves and crimson flowers grouped in terminal clusters. The flower buds initially have a pale hue, gradually turn green, then transition to a bright red when ready for harvest. Cloves are harvested at 1.5–2 centimetres  in long, and consist of a long calyx that terminates in four spreading sepals, and four unopened petals that form a small central ball.Clove stalks are slender stems of the inflorescence axis that show opposite decussate branching. Externally, they are brownish, rough, and irregularly wrinkled longitudinally with short fracture and dry, woody texture. Mother cloves (anthophylli) are the ripe fruits of cloves that are ovoid, brown berries, unilocular and one-seeded. Blown cloves are expanded flowers from which both corollae and stamens have been detached. Exhausted cloves have most or all the oil removed by distillation. They yield no oil and are darker in color.",
        "etymology": "The word clove, first used in English in the 15th century, derives via Middle English clow of gilofer,[7] Anglo-French clowes de gilofre and Old French clou de girofle, from the Latin word clavus nail.[8][9] The related English word gillyflower, originally meaning clove, derives[10] via said Old French girofle and Latin caryophyllon, from the Greek karyophyllon clove, literally nut leaf.",
        "history": "Until the colonial era, cloves only grew on a few islands in the Moluccas (historically called the Spice Islands), including Bacan, Makian, Moti, Ternate, and Tidore.[26] One clove tree named Afo that experts believe is the oldest in the world on Ternate may be 350–400 years old. Cloves were first traded by the Austronesian peoples in the Austronesian maritime trade network (which began around 1500 BC, later becoming the Maritime Silk Road and part of the Spice Trade). The first notable example of modern clove farming developed on the east coast of Madagascar, and is cultivated in three separate ways, a monoculture, agricultural parklands, and agroforestry systems.",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Myrtales",
        "family": "Myrtaceae",
        "genus": "Syzygium",
        "image": "https://i.ibb.co/NjHYxGS/clove-1326474-640.jpg",
        "image1": "https://i.ibb.co/34wKCjs/Syzygium-aromaticum-K-hler-s-Medizinal-Pflanzen-030.jpg",
        "category": "spices",
        "status": "spices"
    },
    {
        "name": "Cumin Seeds",
        "id": 7,
        "description": "Cumin (/ˈkʌmɪn/,[2][3] /ˈkjuːmɪn/;[2][3] US also /ˈkuːmɪn/;[2] Cuminum cyminum) is a flowering plant in the family Apiaceae, native to the Irano-Turanian Region.[4] Its seeds – each one contained within a fruit, which is dried – are used in the cuisines of many cultures in both whole and ground form. Although cumin is used in traditional medicine, there is no high-quality evidence that it is safe or effective as a therapeutic agent",
        "etymology": "The term comes via Middle English comyn, from Old English cymen (which is cognate with Old High German kumin) and Old French cummin, both from the Latin term cuminum. This in turn comes from the Ancient Greek κύμινον (kúminon), a Semitic borrowing related to Hebrew (kammōn). All of these ultimately derive from Akkadian 𒂵𒈬𒉡 (kamūnu).",
        "history": "Likely originating in Central Asia, Southwestern Asia, or the Eastern Mediterranean,[13][14] cumin has been in use as a spice for thousands of years.[12] Seeds of wild cumin were excavated in the now-submerged settlement of Atlit-Yam, dated to the early 6th millennium BC.[4] Seeds excavated in Syria were dated to the second millennium BC.[15] They have also been reported from several New Kingdom levels of ancient Egyptian archaeological sites.[13][14] In the ancient Egyptian civilization, cumin was used as a spice and as a preservative in mummification.",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Apiales",
        "family": "Apiaceae",
        "genus": "Cuminum",
        "category": "spices",
        "image": "https://i.ibb.co/SmHqVLv/1ffbc3cc4d20baa4f3302bfc672de6d4-jpg-750x750-jpg.webp",
        "image1": "https://i.ibb.co/LSkNHMG/Cuminum-cyminum-K-hler-s-Medizinal-Pflanzen-198.jpg",
        "status": "seeds"
    },
    {
        "name": "Dry Red Chili",
        "id": 8,
        "description": "Chili peppers, also spelled chile or chilli[3] (from Classical Nahuatl chīlli [ˈt͡ʃiːlːi] ⓘ), are varieties of the berry-fruit of plants from the genus Capsicum, which are members of the nightshade family Solanaceae, cultivated for their pungency.[4] Chili peppers are widely used in many cuisines as a spice to add heat to dishes. Capsaicin and related compounds known as capsaicinoids are the substances that give chili peppers their intensity when ingested or applied topically. Chili peppers exhibit a wide range of heat and flavors. This diversity is the reason behind the availability of different types of paprika and chili powder, each offering its own distinctive taste and heat level.Chili peppers are believed to have originated somewhere in Central or South America[6][7][8] and were first cultivated in Mexico.[9] European explorers brought chili peppers back to the Old World in the late 16th century as part of the Columbian Exchange, which led to many cultivars of chili pepper spreading around the world and finding use in both food and traditional medicine. This led to a wide variety of cultivars, including the annuum species, with its glabriusculum variety and New Mexico cultivar group, and the species of baccatum, chinense, frutescens, and pubescens.",
        "etymology": "Peppers are commonly broken down into two groupings: bell peppers (UK: sweet peppers) and hot peppers. Most popular pepper varieties are seen as falling into one of these categories or a cross between them..",
        "history": "Capsicum plants originated in modern-day Peru and Bolivia, and have been a part of human diets since about 7,500 BC.[7][11] They are one of the oldest cultivated crops in the Americas.[11] Origins of cultivating chili peppers have been traced to east-central Mexico some 6,000 years ago,[9][12] although, according to researchers at the University of California Berkeley in 2014, chili plants were first cultivated independently across different locations in the Americas including highland Peru & Bolivia, central Mexico, and the Amazon.[8] They were one of the first self-pollinating crops cultivated in Mexico, Central America,[13] and parts of South America",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Solanales",
        "family": "Solanaceae",
        "genus": "Capsicum",
        "image": "https://i.ibb.co/frM53vm/Dried-red-chili.jpg",
        "image1": "https://i.ibb.co/7XvJmbZ/Madame-Jeanette-and-other-chillies.jpg",
        "category": "spices",
        "status": "spices"
    },
    {
        "name": "Garlic",
        "id": 9,
        "description": "Garlic (Allium sativum) is a species of bulbous flowering plant in the genus Allium. Its close relatives include the onion, shallot, leek, chive,[2] Welsh onion, and Chinese onion.[3] It is native to South Asia, Central Asia and northeastern Iran and has long been used as a seasoning worldwide, with a history of several thousand years of human consumption and use.[4][5] It was known to ancient Egyptians and has been used as both a food flavoring and a traditional medicine.[6][7] China produced 73% of the world's supply of garlic in 2021.",
        "etymology": "The word garlic derives from Old English, garlēac, meaning gar (spear) and leek, as a 'spear-shaped leek.",
        "history": "Numerous cuneiform records show that garlic has been cultivated in Mesopotamia for at least 4,000 years.[14] The use of garlic in China and Egypt also dates back thousands of years.[2][14] Well-preserved garlic was found in the tomb of Tutankhamun (c. 1325 BC).[14] It was consumed by ancient Greek and Roman soldiers, sailors, and rural classes (Virgil, Eclogues ii. 11), and, according to Pliny the Elder (Natural History xix. 32), by the African peasantry. Garlic was placed by the ancient Greeks on the piles of stones at crossroads, as a supper for Hecate (Theophrastus, Characters, The Superstitious Man)",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Asparagales",
        "family": "Amaryllidaceae",
        "genus": "Allium",
        "image": "https://i.ibb.co/ThTTf2Z/Garlic-7.jpg",
        "image1": "https://i.ibb.co/Xzvtt0W/Allium-sativum-Woodwill-1793.jpg",
        "category": "spices",
        "status": "spices"
    },
    {
        "name": "Ginger",
        "id": 10,
        "description": "Ginger (Zingiber officinale) is a flowering plant whose rhizome, ginger root or ginger, is widely used as a spice and a folk medicine.[2] It is a herbaceous perennial which grows annual pseudostems (false stems made of the rolled bases of leaves) about one meter tall, bearing narrow leaf blades. The inflorescences bear flowers having pale yellow petals with purple edges, and arise directly from the rhizome on separate shoots Ginger is in the family Zingiberaceae, which also includes turmeric (Curcuma longa),[4] cardamom (Elettaria cardamomum), and galangal. Ginger originated in Maritime Southeast Asia and was likely domesticated first by the Austronesian peoples. It was transported with them throughout the Indo-Pacific during the Austronesian expansion (c. 5,000 BP), reaching as far as Hawaii. Ginger is one of the first spices to have been exported from Asia, arriving in Europe with the spice trade, and was used by ancient Greeks and Romans.[5] The distantly related dicots in the genus Asarum are commonly called wild ginger because of their similar taste",
        "etymology": "The English origin of the word ginger is from the mid-14th century, from Old English gingifer, which derives in turn from the Medieval Latin gingiber, gingiber from the Greek ζιγγίβερις zingiberis[7] from the Prakrit (Middle Indic) siṅgabera, and siṅgabera from the Sanskrit śṛṅgavera..",
        "history": "Ginger was introduced to the Mediterranean by the Arabs, and described by writers like Dioscorides (40–90) and Pliny the Elder (24–79).[23] In 150, Ptolemy noted that ginger was produced in Ceylon (Sri Lanka).[23] Ginger — along with its relative, galangal — was imported into the Roman Empire as part of very expensive herbal remedies that only the wealthy could afford, e.g. for the kidneys. Aëtius of Amida describes both ginger and galangal as ingredients in his complex herbal prescriptions. [24] Raw and preserved ginger was imported into Europe in increased quantity during the Middle Ages after European tastes shifted favorably towards its culinary properties; during this time, ginger was described in the official pharmacopeias of several countries.[6] In 14th century England, a pound of ginger cost as much as a sheep.",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Zingiberales",
        "family": "Zingiberaceae",
        "genus": "Zingiber",
        "image": "https://i.ibb.co/FHzx4J6/Ginger-3.jpg",
        "image1": "https://i.ibb.co/pfHcRnQ/Koeh-146-no-text.jpg",
        "category": "spices",
        "status": "spices"
    },
    {
        "name": "Onion",
        "id": 11,
        "description": "An onion (Allium cepa L., from Latin cepa meaning onion, also known as the bulb onion or common onion, is a vegetable that is the most widely cultivated species of the genus Allium. The shallot is a botanical variety of the onion which was classified as a separate species until 2011.[2][3]: 21  Its close relatives include garlic, scallion, leek, and chive.[4] This genus also contains several other species variously referred to as onions and cultivated for food, such as the Japanese bunching onion Allium fistulosum, the tree onion Allium × proliferum, and the Canada onion Allium canadense. The name wild onion is applied to a number of Allium species, but A. cepa is exclusively known from cultivation. Its ancestral wild original form is not known, although escapes from cultivation have become established in some regions.[5] The onion is most frequently a biennial or a perennial plant, but is usually treated as an annual and harvested in its first growing season.",
        "etymology": "The onion plant (Allium cepa), also known as the bulb onion[6] or common onion,[3]: 9–10  is the most widely cultivated species of the genus Allium.[7][8] It was first officially described by Carl Linnaeus in his 1753 work Species Plantarum.",
        "history": "The history of ancestral onion species is not well documented. Ancient records of onion use spans western and eastern Asia, so the geographic origin of the onion is uncertain.[16][17] Yet, domestication likely took place in West or Central Asia.[3]: 20–21 [18] Onions have been variously described as having originated in Iran, western Pakistan and Central Asia.",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Asparagales",
        "family": "Amaryllidaceae",
        "genus": "Allium",
        "image": "https://i.ibb.co/Bnsxxn0/Onion-6.jpg",
        "image1": "https://i.ibb.co/0ZSXG6d/Mixed-onions.jpg",
        "category": "spices",
        "status": "spices"
    },
    {
        "name": "Star Anise",
        "id": 12,
        "description": "Illicium verum (star anise or badian, Chinese star anise, star anise seed, star aniseed and star of anise) is a medium-sized evergreen tree native to northeast Vietnam and South China. It is a spice that closely resembles anise in flavor and is obtained from the star-shaped pericarps of the fruit of I. verum which are harvested just before ripening. Star anise oil is a highly fragrant oil used in cooking, perfumery, soaps, toothpastes, mouthwashes, and skin creams. Until 2012, when they switched to using a bacterial source, Roche Pharmaceuticals used up to 90% of the world's annual star anise crop to produce shikimic acid, a chemical intermediate used in the synthesis of oseltamivir (Tamiflu)",
        "etymology": "The name badian appears to derive, via French badiane, from the apparently descriptive Chinese name for it, 八角, pinyin: bājiǎo, lit. eight horns. However, a derivation from the Persian بادیان bādiyān, fennel, exists, with the Oxford English Dictionary indicating that its origin before that is unknown..",
        "history": "Japanese star anise (Illicium anisatum), a similar tree, is highly toxic and inedible; in Japan, it has instead been burned as incense. Cases of illness, including serious neurological effects, such as seizures, reported after using star anise tea may be a result of deliberate economically motivated adulteration with this species. Japanese star anise contains the neurotoxin anisatin,[15] which also causes severe inflammation of the kidneys (nephritis), urinary tract, and digestive organs when ingested.",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Austrobaileyales",
        "family": "Schisandraceae",
        "genus": "Illicium",
        "image": "https://i.ibb.co/HrWdzzp/Star-Anise.jpg",
        "image1": "https://i.ibb.co/fkjcKWx/Illicium-verum00.jpg",
        "category": "spices",
        "status": "spices"
    },
    {
        "name": "Black Cardamom",
        "id": 14,
        "description": "Amomum subulatum, also known as black cardamom, hill cardamom,[1] Bengal cardamom,[1] greater cardamom,[1] Indian cardamom,[1] Nepal cardamom,[1] winged cardamom,[1] big cardamon,[2][3] or brown cardamom, is a perennial herbaceous plant in the family Zingiberaceae. Its seed pods have a strong, camphor-like flavour, with a smoky character derived from the method of drying. In Hindi it is called बड़ी इलाइची (baḍī ilāicī).",
        "etymology": "The word cardamom is derived from the Latin cardamōmum,[5] which is the Latinisation of the Greek καρδάμωμον (kardámōmon),[6] a compound of κάρδαμον (kárdamon, cress)[7] and ἄμωμον (ámōmon), which was probably the name for a kind of Indian spice plant.",
        "history": "Cardamom production began in ancient times, and has been referred to in ancient Sanskrit texts as ela.[24] The Babylonians and Assyrians recognized the health benefits of the spice early on, and trade in cardamom opened up along land routes and by the interlinked Persian Gulf route controlled from Dilmun as early as the third millennium BCE Early Bronze Age,[25] into western Asia and the Mediterranean world..",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Zingiberales",
        "family": "Zingiberaceae",
        "genus": "Amomum",
        "image": "https://i.ibb.co/M8tRbyk/Sliding-Image-2.jpg",
        "image1": "https://i.ibb.co/W3JdsP0/Black-Cardamom.jpg",
        "category": "spices",
        "status": "spices"
    },
    {
        "name": "Cashew nuts",
        "id": 16,
        "description": "Cashew is the common name of a tropical evergreen tree Anacardium occidentale, in the family Anacardiaceae. It is native to South America and is the source of the cashew nut and the cashew apple, an accessory fruit. The tree can grow as tall as 14 metres (46 feet), but the dwarf cultivars, growing up to 6 m (20 ft), prove more profitable, with earlier maturity and greater yields. The cashew nut is edible and is eaten on its own as a snack, used in recipes, or processed into cashew cheese or cashew butter. The nut is often simply called a 'cashew'. Cashew can cause allergies triggered by the proteins found in the nuts.  In 2019, four million tonnes of cashew nuts were produced globally, with Ivory Coast and India the leading producers. As well as the nut and fruit, the plant has several other uses. The shell of the cashew seed yields derivatives that can be used in many applications including lubricants, waterproofing, paints, and, starting in World War II, arms production.[1][full citation needed] The cashew apple is a light reddish to yellow fruit, whose pulp and juice can be processed into a sweet, astringent fruit drink or fermented and distilled into liquor.",
        "etymology": "The English name derives from the Portuguese name for the fruit of the cashew tree: caju (Portuguese pronunciation: [kaˈʒu]), also known as acaju, which itself is from the Tupi word acajú, literally meaning nut that produces itself",
        "history": "The species is native to Northeastern Brazil, and later was distributed around the world in the 1500s by Portuguese explorers.[3][14][6] Portuguese colonists in Brazil began exporting cashew nuts as early as the 1550s.[15] The Portuguese took it to Goa former Estado da Índia Portuguesa India between 1560 and 1565. From there, it spread throughout Southeast Asia and eventually Africa",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Anacardium",
        "image": "https://i.ibb.co/GsPQ7RC/Cashew-nuts-2.jpg",
        "image1": "https://i.ibb.co/v134dfV/Anacardium-occidentale-K-hler-s-Medizinal-Pflanzen-010.jpg",
        "category": "DryFood",
        "status": "DryFood"
    },
    {
        "name": "Black Cumin Seeds",
        "id": 17,
        "description": "Nigella sativa (black caraway, also known as black cumin, nigella, kalonji, charnushka[2])[3][4][5] is an annual flowering plant in the family Ranunculaceae, native to eastern Europe (Bulgaria and Romania) and western Asia (Cyprus, Turkey, Iran and Iraq), but naturalized over a much wider area, including parts of Europe, northern Africa and east to Myanmar.[1] It is used as a spice in many cuisines.",
        "etymology": "The genus name Nigella is a diminutive of the Latin niger black, referring to the seed color.[6][7] The specific epithet sativa means cultivated.[6]     In English, Nigella sativa and its seed are variously called black caraway, black seed, black cumin, fennel flower, nigella, nutmeg flower, Roman coriander,[3][6] black onion seed[8] and kalonji",
        "history": "Archaeological evidence about the earliest cultivation of N. sativa dates back three millennia, with N. sativa seeds found in several sites from ancient Egypt, including the Tomb of Tutankhamun.[5][13] Seeds were found in a Hittite flask in Turkey from the second millennium BC.sativa may have been used as a condiment of the Old World to flavour food.[6][13] The Muslim physician Avicenna described N. sativa as a treatment for dyspnea in his The Canon of Medicine.[15] N. sativa was used in the Middle East as a traditional medicine.",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Apiales",
        "family": "Apiaceae",
        "genus": "Nigella",
        "image": "https://i.ibb.co/xGpkrvV/Image-For-News-771804-17078769479946019.webp",
        "image1": "https://i.ibb.co/dBCk9tb/Nsativa001-Wien.jpg",
        "category": "spices",
        "status": "seeds"
    },
    {
        "name": "Mustard Seeds",
        "id": 18,
        "description": "Mustard seeds are the small round seeds of various mustard plants. The seeds are usually about 1 to 2 millimetres (1⁄32 to 3⁄32 in) in diameter and may be colored from yellowish white to black. They are an important spice in many regional foods and may come from one of three different plants: black mustard (Brassica nigra), brown mustard (B. juncea), or white mustard (Sinapis alba).Grinding and mixing the seeds with water, vinegar or other liquids creates the yellow condiment known as mustard.",
        "etymology": "The English wordmustard derives from the Anglo-Norman mustarde and Old French mostarde. (Modern French is moutarde.) The first element is ultimately from Latin mustum (must, unfermented grape juice)—the condiment was originally prepared by making the ground seeds into a paste with must or verjuice. It was first attested in English in the late 13th century, though it was found as a surname a century earlier.",
        "history": "Archaeological excavations in the Indus Valley (Indian Subcontinent) have revealed that mustard was cultivated there. That civilization existed until about 1850 BCE.[4] Mustard has been used in Africa and China for thousands of years. Mustard greens have been popularly consumed in China. Yellow mustard paste originated in China during the Zhou Dynasty (1046–256 BCE) where the mustard seeds were ground and made into paste. It was often used in the royal courts during the Zhou Dynasty to help whet the appetite for the later courses in a mea",
        "kingdom": "Plantae",
        "clade": "Angiosperms",
        "order": "Brassicales",
        "family": "Brassicaceae",
        "genus": "Sinapis",
        "image": "https://i.ibb.co/0tMD1R0/c3abcaf2dcc17edd5cad40508950cbec-jpg-720x720q80.jpg",
        "image1": "https://i.ibb.co/Qbm8hyk/Mustard.png",
        "category": "spices",
        "status": "seeds"
    }
]